artillery/addtocart.yml
config:
  target: https://quesadilla-endeavor.square.site/
  engines:
    playwright: {}
  processor: './addtocart.js'
  phases:
    - name: Warm up phase
      duration: 10
      arrivalRate: 1
      rampTo: 2
    - name: Ramp up phase
      duration: 10
      arrivalRate: 5
      rampTo: 6
    - name: Spike phase
      duration: 10
      arrivalRate: 10
      rampTo: 15
scenarios:
  - engine: playwright 
    testFunction: artilleryScript